Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: ཞེ་སྡང་མེད། གཏི་མུག་མེད། མི་མཐོ་མི་དམའ། མི་རྟོག་རྣམ་པར་མི་རྟོག །མི་འགྲོ་རྣམ་པར་མི་འགྲོ་ཞིང་ཉན་ཐོས་དང་།
en: They realize that the aggregates, the elements, and the sense fields lack desire, anger, and ignorance, high and low, conceptual thought and conceptualization, and going and ceasing, and that the awakening of the hearers and the solitary buddhas, as well as unsurpassed and perfect awakening, also lack conceptual thought and conceptualization, going and ceasing.

source: རང་སངས་རྒྱས་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱང་མི་རྟོག་རྣམ་པར་མི་རྟོག །མི་འགྲོ་རྣམ་པར་མི་འགྲོ་བ་འདི་ནི་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པའོ། །
en: Noble son, this is the bodhisattvas’ entrance to the gateway to the Dharma of nonduality.”

source: བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པས་འདི་བསྟན་པ་སྟོན་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་བཞི་བཅུ་རྩ་དྲུག་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་ལ་འཇུག་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: As this teaching was being delivered by the bodhisattva Immaculate Splendor, 9,200,000,000 bodhisattvas achieved the acceptance of the unborn nature of phenomena and 4,600,000,000 of them reached the entrance to the gateway to the Dharma of nonduality.

source: བཅོམ་ལྡན་འདས་ཀྱང་སྒྲོན་མ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལས་བཞེངས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་དྲང་སྲོང་གི་ཆ་བྱད་ཇི་ཙམ་པ་མི་སྣང་བར་གྱུར་ཏེ། སངས་རྒྱས་ཀྱི་སྐུ་མཚན་རབ་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་སྐུ་ཡང་དག་པར་བརྒྱན་ཏེ་བཞུགས་སོ། །
en: The Blessed One then arose from the absorption called endowed with light, no longer appeared to be dressed as a seer, and sat there with his body adorned with the thirty-two supreme physical marks of a buddha.

source: དེ་ལྟར་དེ་བཞིན་དུ་གང་གཞན་ལ་ལ་དག་ཀྱང་དྲང་སྲོང་གི་ཆ་བྱད་མི་སྣང་བར་གྱུར་ཏེ། སྔོན་གྱི་ལུས་ཇི་ལྟ་བ་བཞིན་དུ་འཁོད་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་གཟི་བརྗིད་དྲི་མ་མེད་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: All of the other beings also no longer appeared to be dressed as seers and their previous bodies were restored.

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཇི་ལྟ་བུར་བསྟན་པ་དེ་བཞིན་དུ་གཉིས་སུ་མེད་པའི་སྒོ་འདི་བསྟན་པར་བྱ་བ་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One expressed his approval to the bodhisattva Immaculate Splendor, saying, “Noble son, the way that you have taught this is exactly the way that one should teach the gateway of nonduality. Well done!

source: རིགས་ཀྱི་བུ་ཁྱོད་ནི་ཆོས་ཀྱི་སྒོ་འདི་ལ་ལུས་དཔང་དུ་བཙུགས་ཏེ། དེ་ལྟར་ཁྱོད་ཀྱིས་ཚད་མེད་པའི་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བཀོད་དོ། །གཞན་ཡང་ལྷ་དང་། ཀླུ་དང་།
en: Noble son, you have borne witness yourself to this gateway to the Dharma, and so you have established countless beings in unsurpassed and perfect awakening!”

source: གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། མི་དང་མི་མ་ཡིན་པ་རྣམས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་སྣ་ཚོགས་བྱས་སོ།། །།བམ་པོ་གསུམ་པ།
en: The gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, humans, and nonhumans who were present then made various offerings to the Blessed One.

source: དེ་ནས་དེའི་ཚེ་ན་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ། ཕྱག་འཚལ་ནས་བཅོམ་ལྡན་འདས་ལ་ཆོས་བསྟན་དུ་གསོལ་བའི་ཕྱིར་ཚིགས་སུ་བཅད་པའི་ཡོན་ཏན་འདི་དག་གིས་བསྟོད་དོ། །རྒྱལ་བ་མི་མཉམ་ཞིང་མངས་དག་ཁྱབ་པ། །ཉོན་མོངས་དགྲ་ཞི་འདི་ལ་མངོན་པར་གནས། །
en: At that moment Mañjuśrīkumārabhūta draped his shawl over one shoulder, prostrated toward the Blessed One with his palms joined, and praised the Blessed One with the following verses, requesting him to teach the Dharma: “Peerless victor, you pervade many realms And you have subdued and pacified the enemies: the afflictions.

source: ཐུབ་པ་ཤིན་ཏུ་རྣམ་གྲོལ་འདིར་ཞུགས་ཤིང་། །ཁྱོད་ཀྱིས་འགྲོ་ལ་བཟོད་པའི་མཆོག་འདི་སྟོན། །
en: Liberated sage, please enter this place And reveal this supreme acceptance to beings!

source: རབ་ཏུ་ཞི་ཐུགས་བརྟུལ་ཞུགས་ཡོངས་སུ་དག །
en: “Your mind is at peace and your observances are immaculate.

source: ཐུབ་པ་མཆོད་སྦྱིན་བགྱིས་པ་བཟོད་དགེ་གསུངས། །
en: Sage who has performed the sacrifice, please teach this virtuous acceptance!

source: འགྲོ་ལ་བདེ་སྦྱིན་དྲང་སྲོང་ཤེས་རབ་འཆང་། །གཏི་མུག་འཇིག་མཛད་འདི་ལ་བདུད་རྩི་ཆར། །
en: Provider of happiness to beings, seer who upholds insight, Destroyer of delusion, please shower a rain of ambrosia on this place!

source: འདི་ལ་ལྷ་ཀླུ་སེམས་ཅན་མི་མང་པོ། །ཤིན་ཏུ་གསལ་ཡིད་མྱུར་དུ་ཞིང་གང་བ། །
en: “Many gods, nāgas, and humans with clear minds Have quickly filled this realm.

source: འགྲོ་བ་ཐམས་ཅད་ཁྱོད་ཞལ་ལྟ་ཞིང་འདུག །
en: All these beings are sitting here gazing upon you.

source: ཉོན་མོངས་ཡོངས་སུ་སྤངས་ཏེ་དམ་ཆོས་གསུངས། །
en: Having abandoned defilements, teach them the sacred Dharma!

source: སྔོན་ཆད་རྒྱལ་བ་ཁྱོད་ཀྱང་ཀུན་སྤྱོད་བསྟན། །
en: “Victor, in the past you have displayed your conduct.

source: མིག་གཉིས་རྐང་པ་ལག་པ་ལྕེ་བྱིན་ཞིང་། །
en: You gave away your eyes, your feet, your hands, and your tongue.

source: པགས་པ་མགོ་ཁྲག་ཡན་ལག་དམ་འབྲུ་ནོར། །གླང་རྟ་བུ་གྲོང་ཤིང་རྟ་རིན་ཆེན་རྣམ་མང་བྱིན། །
en: You gave your skin, your head, your blood, and your limbs, And large amounts of grain, jewels, elephants, horses, sons, cities, and precious steeds.

source: ཟས་སྐོམ་མལ་དང་བྲན་ཕོ་བྲན་མོ་བྱིན། །
en: “You gave away food, drinks, your bed, and male and female servants.

source: གཉེན་དང་འགྲོ་ལ་སྡུག་བསྔལ་རྟག་ཐར་བྱེད། །བསམ་པ་རྫོགས་ཤིང་སེམས་ཅན་དགའ་མཛད་པ། །
en: You constantly liberate your relatives and other beings from their suffering; You fulfill all wishes, and you bring joy to beings.

source: ཁྱོད་ཀྱིས་མཆོད་སྦྱིན་བརྒྱ་བྱས་སེམས་ཅན་ཕྱིར། །སངས་རྒྱས་མང་ལ་སྔོན་ཆད་དགེ་མཆོད་བྱས། །
en: You performed one hundred sacrifices for beings, “And offered the virtue you accumulated in the past to the many buddhas.

source: བྱམས་སེམས་རྟག་པས་ཐེར་ཟུག་སྦྱིན་ལ་དགའ། །
en: You are always loving and delight in constant generosity.

source: བརྟུལ་ཞུགས་བརྟན་པས་རི་རབ་ཇི་བཞིན་འབར། །
en: You are steadfast in observances and blaze like Mount Sumeru.

source: འགྲོ་ལ་བརྟན་ཕྱིར་བཟོད་པ་འདི་བསྟན་གསོལ། །
en: Please teach this acceptance to bring stability to beings!

source: ངན་སོང་གསུམ་སྤངས་སེམས་ཅན་མཐོ་རིས་ཁྲིད། །ཁྱོད་ཀྱིས་བསྟན་པའི་སྨོན་ལམ་སྔོན་རྟག་བྱས། །
en: “In the past, you continually made the aspiration to show beings How to abandon the three lower realms and to lead them to the higher realms.

source: འགྲོ་བ་བྱང་ཆུབ་སྡུག་བསྔལ་ཞི་མཆོག་རིག །
en: You cause beings to reach awakening—the supreme pacification of suffering.

source: རྒྱལ་བ་སྔོན་ཆད་ཅི་བཞིན་བྱང་ཆུབ་དེ་ཐོབ་བོ། །སྙིང་རྗེ་དཔལ་ཆུས་ས་རྣམས་མ་ལུས་གང་། །
en: Victor, you achieved genuine awakening in the past “And you saturate the entire earth with the glorious water of your compassion.

source: ཉོན་མོངས་དྲི་གསུམ་ཐེ་ཙོམ་ཐམས་ཅད་ཞི། །ལམ་གང་ཞི་བས་བྱང་ཆུབ་ཐོབ་སྟོན་པ། །ཇི་ལྟར་ཆོས་རྟོགས་འདི་ལ་ཁྱོད་ཀྱིས་དུས། །
en: You pacify the afflictions, the three stains, and all doubts, And by pacifying these, you show the path that leads to awakening.

source: ཤིན་ཏུ་སྐོམ་ཡིད་འགྲོ་ལ་ཆོས་ཆར་ཕོབ། །
en: Just like when you realized the Dharma, “Please shower a rain of Dharma on beings whose minds are parched!

source: བདུད་རྩིའི་རོས་ངོམས་ཡང་དག་ཡོན་ཏན་གསུངས། །
en: Please quench their thirst with ambrosia and reveal the right qualities!

source: ལམ་གང་ཞི་དེས་འགྲོ་བ་བྱང་ཆུབ་རེག །ཞིང་མངས་འདི་ལ་སེམས་ཅན་གང་དག་འོངས། །རྒ་ཤི་དག་ལས་རྣམ་ཐར་གང་ཡོད་པ། །
en: Beings reach awakening through the path of peace, And the beings who have come from numerous realms to this one “Are here to be liberated from old age and death.

source: ཐུབ་པ་ཆེན་པོ་ཆོས་འདི་གསུང་དུ་གསོལ། །
en: Great sage, please teach them this Dharma.

source: ནམ་མཁའི་མདོག་གིས་འདུལ་བའི་བཟོད་པ་སྟོན། །
en: Teach the acceptance that tames beings with the sky-colored method of perfect conduct!

source: དེ་ནི་སྒྱུ་མ་སྨིག་རྒྱུ་སྤྲོས་པར་འགྲོ། །
en: This will lead them to understand elaborations as illusions and mirages.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་ཞལ་གྱིས་བཞེས་ནས། དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། བདག་རྣམ་པ་དེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ནས་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་པ་གང་གིས་ཁང་པ་བརྩེགས་པ་ཇི་སྙེད་པ་དེ་སྙེད་དུ་ལུས་མངོན་པར་སྤྲུལ་ནས་ཁང་པ་བརྩེགས་པ་ཐམས་ཅད་ན་འདུག་སྟེ།
en: The Blessed One gave his consent to Mañjuśrīkumārabhūta by not saying a word and thought, “I will enter into that type of absorption, and, through that absorption, I will emanate bodies that will sit in all those storied mansions.

source: འཁོར་འདི་དག་ཀྱང་ཡང་དག་པར་དགའ་ཞིང་སྐྱོ་བར་བྱའོ་སྙམ་པ་དང་།
en: I will then please those assemblies and make them grow weary of saṁsāra.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་འོད་ཤིན་ཏུ་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ།
en: The Blessed One entered the absorption known as the array of light.

source: མཉམ་པར་བཞག་པའི་ཐུགས་ཀྱིས་ཁང་པ་བརྩེགས་པ་ཇི་སྙེད་པ་དེ་སྙེད་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རང་རང་ཞུགས་ཏེ་བཞུགས་སོ། །
en: With his mind in meditative equipoise, the blessed Buddha entered each and every one of those storied mansions and took a seat.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ངོ་མཚར་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁང་པ་བརྩེགས་པ་ཚད་མེད་པ་འདི་དག་ནི་གང་ན་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་བདག་ཁང་པ་བརྩེགས་པ་ན་བཞུགས་པ་ནི་གང་།
en: The bodhisattva Filled with Amazement then asked the bodhisattva Uncovering the Enemies, “Noble son, which of these innumerable storied mansions is the storied mansion in which the Thus-Gone One is sitting?

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཁང་པ་བརྩེགས་པར་སངས་རྒྱས་ཀྱི་སྐུ་བཞུགས་པར་ཡང་དག་པར་མཐོང་བ་ནི་གང་།
en: Through the empowering force of the Buddha, we see his body residing in all those mansions. What is this all about?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པས་བྱང་ཆུབ་སེམས་དཔའ་ངོ་མཚར་དང་ལྡན་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་ཚིག་འདི་ནི་སྨྲ་བ་མེད་པའོ། །
en: The bodhisattva Uncovering the Enemies replied, “Noble son, the term thus-gone one is inexpressible.

source: མ་རིག་པ་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ལ་སྤྲོས་པ་མེད་དོ། །
en: Even ignorance is without elaborations in the teachings of the Buddha.

source: རིགས་ཀྱི་བུ་ཅི་འདས་པའི་སེམས་ཀྱིས་བྱང་ཆུབ་ཐོབ་བམ།
en: Noble son, does the past mind achieve awakening?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་མ་ཡིན་ནོ། །
en: “No, noble son.”

source: སྨྲས་པ། ཅི་མ་འོངས་པའི་སེམས་ཀྱིས་བྱང་ཆུབ་ཐོབ་བམ། སྨྲས་པ།
en: “Does the future mind achieve awakening?”

source: རིགས་ཀྱི་བུ་མ་ཡིན་ནོ། །སྨྲས་པ།
en: “No, noble son.”

source: ཅི་ད་ལྟར་བྱུང་བའི་སེམས་དང་། བསམ་པའི་གནས་པ་ཡོད་དམ། སྨྲས་པ།
en: “Is there a dwelling place for the present mind and thoughts?”

source: རིགས་ཀྱི་བུ་མེད་དོ། །སྨྲས་པ།
en: “No, noble son.”

source: གལ་ཏེ་རེ་ཞིག་སེམས་དང་། བསམ་པའི་གནས་པ་མེད་ན་རྣམ་པར་མི་གནས་པའི་དངོས་པོ་ལ་ཇི་ལྟར་བྱང་ཆུབ་ཐོབ།
en: “If the mind and thoughts lack a present dwelling place, how could something that does not dwell anywhere achieve awakening?”

source: སྨྲས་པ། རིགས་ཀྱི་བུ་ཅི་དུས་གསུམ་གྱི་ཆོས་ཐམས་ཅད་སྤངས་པས། དེའི་ཚེ་ཅིས་ཀྱང་ཆོས་ཁོང་དུ་ཆུད་པ་མེད་དམ།
en: “Noble son, once all the phenomena of the three times are abandoned, is it not the case that there is no comprehension of phenomena?”

source: སྨྲས་པ། རྟག་པ་དང་ཆད་པ་ཡོངས་སུ་སྤངས་པ།
en: “Permanence and impermanence are completely abandoned.

source: མི་འགྲོ་བ། མི་སྐྱེ་བ། མི་འགོག་པ། མི་རེག་པ།
en: There is no transmigration, no birth, no cessation, and no contact.

source: འདུས་བྱས་དང་། འདུས་མ་བྱས་ལ་གནས་པ་མེད་པའོ། །
en: Conditioned and unconditioned phenomena are baseless.

source: དངོས་པོ་ཐམས་ཅད་ནམ་མཁའ་དང་མཉམ་པ་ལ་བྱང་ཆུབ་འགྲོ་བ་མེད་དོ། །
en: All things are like space and lack awakening and transmigration.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་མེད་ཅིང་སྙེམས་པ་མེད་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་ཀྱང་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་མེད་དོ། །
en: Just as space has no past, present, or future, and no conceit, awakening also has no past, present, or future.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པའང་མེད་དོ། །
en: Just as space lacks concepts and conceptualization, the awakening of the buddhas also lacks concepts and conceptualization.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་མུན་པ་མེད་ཅིང་སྣང་བ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མུན་པ་མེད་ཅིང་སྣང་བའང་མེད་དོ། །
en: Just as space lacks darkness and light, the qualities of the buddhas also lack darkness and light.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཟུགས་མེད་ཅིང་བསྟན་དུ་ཡང་མེད་དོ། །
en: Just as space lacks forms and is undefinable, the qualities of the buddhas also lack forms and are undefinable.

source: ཇི་ལྟར་ནམ་མཁའ་མ་སྐྱེས་མ་འགགས་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་མ་སྐྱེས་མ་འགགས་སོ། །
en: Just as space is unborn and unceasing, the qualities of the buddhas are also unborn and unceasing.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་འགྲོ་བ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་འགྲོ་བར་དམིགས་པ་མེད་དོ། །
en: Just as space lacks going, the qualities of the buddhas also lack the apprehension of going.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་གནས་པ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་གནས་པ་མེད་དོ། །
en: Just as space is groundless, the qualities of the buddhas are also groundless.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་རེག་པ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་རེག་པ་མེད་དོ། །
en: Just as space lacks contact, the qualities of the buddhas also lack contact.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་ལམ་དུ་དམིགས་པ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་ཅི་ལའང་ལམ་དུ་དམིགས་པ་མེད་དོ། །
en: Just as space lacks the apprehension of a path, the qualities of the buddhas also lack the apprehension of a path.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་དངོས་པོ་མེད་ཅིང་མཚན་ཉིད་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་དངོས་པོ་མེད་ཅིང་མཚན་ཉིད་མེད་དོ། །
en: Just as space is insubstantial and devoid of characteristics, the qualities of the buddhas are also insubstantial and devoid of characteristics.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་བརྗོད་དུ་མེད་ཅིང་ཡི་གེ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱང་བརྗོད་དུ་མེད་ཅིང་ཡི་གེ་མེད་དོ། །
en: Just as space is inexpressible and lacks words, the awakening of the buddhas is also inexpressible and lacks words.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་རྟག་པ་མེད་ཅིང་ཆད་པ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་རྟག་པ་མེད་ཅིང་ཆད་པ་མེད་དོ། །
en: Just as space lacks permanence and impermanence, the qualities of the buddhas also lack permanence and impermanence.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་ལུས་མེད་ཅིང་འབྱུང་བ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་ལུས་མེད་ཅིང་འབྱུང་བ་མེད་དོ། །
en: Just as space lacks a body and lacks origination, the qualities of the buddhas also lack a body and lack origination.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་གཟུང་བ་མེད་ཅིང་གནས་པ་མེད་པ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཟུང་བ་མེད་ཅིང་གནས་པ་མེད་དོ། །ཇི་ལྟར་ནམ་མཁའ་ལ་རྟེན་པ་མེད་པ། གནས་པ་མེད་པ། དམིགས་པ་མེད་པ། རྣམ་པར་རྟོག་པ་མེད་པ། འདེག་པ་མེད་པ། རྣམ་པར་རིག་པ་མེད་པ། འགྲོ་བ་མེད་པ། འོང་བ་མེད་པ། རྩ་བ་མེད་པ། མཐའ་མེད་པ། འཁྲུག་པ་མེད་པ། ཡོངས་སུ་གདུངས་པ་མེད་པ། བརྟགས་པ་མེད་པ། བཀྲོལ་བ་མེད་པ། མཐོང་བ་མེད་པ།
en: Just as space lacks apprehended objects and lacks abiding, the qualities of the buddhas also lack apprehended objects and lack abiding.

source: རྟོག་པ་མེད་པ། མུན་པ་མེད་པ། དངོས་པོ་མེད་པ། མཚན་མ་མེད་པ། སྤྲུལ་པ་མེད་པ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་རྟེན་པ་མེད་པ་ནས་མཚན་མ་མེད་པའི་བར་དུའོ། །
en: Just as space has no support, is baseless, lacks observation, and lacks conceptualization, ascending, knowledge, going, coming, origin, limit, disturbance, torment, examination, commenting, vision, concepts, darkness, entities, marks, and manifestation, noble son, the qualities of the buddhas also lack everything from having no support up to lacking marks.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་མི་སྐྱེ་བར་བསྒྲགས་པའོ། །
en: “Noble son, the qualities of the buddhas are said to be unborn.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་གཉིས་སུ་མེད་པའི་ཆ་ཤས་སོ། །ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པའོ། །
en: The qualities of the buddhas have the characteristic of being nondual and they dwell in the realm of phenomena.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་སེམས་ཅན་གྱི་ཁམས་སུ་ཡང་དག་པར་འདུས་པའོ། །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ནམ་མཁའི་ཁམས་སུ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in the realm of sentient beings, and the qualities of the buddhas are contained in the realm of space.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་རྟོགས་པ་དང་ཀུན་ཏུ་རྟོག་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: Noble son, the qualities of the buddhas are contained in thoughts and concepts.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་གནས་དང་། རྣམ་པའི་གནས་དང་། རབ་ཀྱི་གནས་སུ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in the realms, various places, and superior places.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཤེས་པ་དང་མ་ཤེས་པ་དང་། རབ་ཏུ་ཤེས་པ་དང་། རྣམ་པར་ཤེས་པ་དང་། ཉེ་བར་ཤེས་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in knowing, not knowing, advanced knowledge, thorough knowledge, and complete knowledge.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་མཚན་མ་མེད་པ་ཡང་དག་པའི་མཚན་ཉིད་དང་། རྣམ་པའི་མཚན་ཉིད་དང་། ཉེ་བའི་མཚན་ཉིད་དང་། རྗེས་སུ་མཚན་ཉིད་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in the absence of marks, in correct characteristics, in partial characteristics, in complete characteristics, and in subsequent characteristics.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་འདས་པ་མེད་པ་དང་། རྣམ་པར་འདས་པ་དང་། འདས་པ་དང་། རྗེས་སུ་འདས་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in the absence of transcendence, in thorough transcendence, in transcendence, and in subsequent transcendence.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་བླངས་པ་དང་། དོར་བ་དང་། ཀུན་ཏུ་བླང་བ་དང་། ཉེ་བར་བླང་བ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in accepting, rejecting, clinging, and appropriation.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་སྣང་བ་དང་། ཀུན་ཏུ་སྣང་བ་དང་། རྗེས་སུ་སྣང་བ་དང་། ཡང་དག་པར་སྣང་བ་མེད་པ་དང་། རབ་ཏུ་སྣང་བ་མེད་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The characteristics of the buddhas are contained in light, total illumination, subsequent illumination, the absence of illumination, and the absence of absolute illumination.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཡང་དག་པ་དང་། ཤིན་ཏུ་ཡང་དག་པ་དང་། རྗེས་སུ་ཡང་དག་པ་དང་། ཀུན་ཏུ་ཡང་དག་པ་མ་ཡིན་པ་དང་། རབ་ཏུ་ཡང་དག་པ་མ་ཡིན་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in what is genuine, completely genuine, subsequently genuine, not fully genuine, and not absolutely genuine.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཀུན་ཏུ་སྨྲ་བ་དང་། རྣམ་པར་སྨྲ་བ་དང་། ཤིན་ཏུ་སྨྲ་བ་དང་། རྗེས་སུ་སྨྲ་བ་དང་། རབ་ཏུ་སྨྲ་བ་དང་། ཉེ་བར་སྨྲ་བ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in statements, thorough statements, full statements, subsequent statements, absolute statements, and complete statements.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཀུན་ཏུ་རིག་པ་དང་། རྣམ་པར་རིག་པ་དང་མཚུངས་པར་རིག་པ་དང་རྗེས་སུ་རིག་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in full knowledge, complete knowledge, identical knowledge, and subsequent knowledge.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་ཀུན་ཏུ་གཟུགས་དང་། རྣམ་པར་གཟུགས་དང་། མཚུངས་པར་གཟུགས་དང་། ཡང་དག་པར་གཟུགས་དང་། ཉེ་བའི་གཟུགས་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: The qualities of the buddhas are contained in forms, full forms, identical forms, true forms, and complete forms.

source: རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ནི་ཀུན་ཏུ་སྤྱོད་པ་དང་། རྣམ་པར་སྤྱོད་པ་དང་། མཚུངས་པར་སྤྱོད་པ་དང་། རྗེས་སུ་སྤྱོད་པ་དང་། ཉེ་བར་སྤྱོད་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: Noble son, the awakening of the buddhas is contained in conduct, thorough conduct, identical conduct, subsequent conduct, and complete conduct.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་ཀུན་ཏུ་བརྗོད་པ་དང་། རྣམ་པར་བརྗོད་པ་དང་། རྗེས་སུ་བརྗོད་པ་དང་། མཚུངས་པར་བརྗོད་པ་དང་། ཉེ་བར་བརྗོད་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: Noble son, awakening is contained in expressions, thorough expressions, subsequent expressions, identical expressions, and complete expressions.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་བགྲང་བ་དང་། རྣམ་པར་བགྲང་བ་དང་། མཚུངས་པར་བགྲང་བ་དང་། རྗེས་སུ་བགྲང་བ་དང་། ཉེ་བར་བགྲང་བ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: Noble son, awakening is contained in enumeration, thorough enumeration, identical enumeration, subsequent enumeration, and complete enumeration.

source: བྱང་ཆུབ་ནི་ཀུན་ཏུ་ཡོད་པ་དང་། རྣམ་པར་ཡོད་པ་དང་། རྗེས་སུ་ཡོད་པ་དང་། ཉེ་བར་ཡོད་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: Awakening is contained in existence, thorough existence, subsequent existence, and complete existence.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་ནི་སྤྲོས་པ་དང་། རྣམ་པར་སྤྲོས་པ་དང་། སྤྲོས་པ་དང་བྲལ་བ་དང་། རྗེས་སུ་སྤྲོས་པ་དང་། ཉེ་བར་སྤྲོས་པ་ལ་ཡང་དག་པར་འདུས་པའོ། །
en: Noble son, awakening is contained in elaboration, thorough elaboration, freedom from elaboration, subsequent elaboration, and complete elaboration.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ནམ་མཁའི་ཁམས་ལ་གཟུང་དུ་མེད་པ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་བལྟ་བར་བྱའོ། །
en: “Noble son, one should regard the awakening of the buddhas as devoid of apprehension, like space.

source: རིགས་ཀྱི་བུ་ལ་ལ་ནམ་མཁའ་སྤྲོས་པར་བྱ་བ་དང་། ཚད་དུ་བྱ་བ་དང་། རྣམ་པར་འགྲན་པར་བྱ་བ་དང་། བརྒྱན་པར་བྱ་བ་དང་། རི་མོར་བྱ་བར་ནུས་སམ།
en: Noble son, is anyone able to expand, measure, rival, ornament, or depict space?”

source: རིགས་ཀྱི་བུ་མི་ནུས་སོ། །སྨྲས་པ།
en: “No, noble son, no one is able to do so.”

source: རིགས་ཀྱི་བུ་ནམ་མཁའ་ཇི་ལྟ་བ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་དེ་བཞིན་ཏེ།
en: “Noble son, the qualities of the buddhas are like space.

source: ནམ་མཁའ་ཅིས་ཀྱང་སྤྲོས་པར་མི་ནུས་པ་ཇི་ལྟ་བ་དེ་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་དེ་བཞིན་དུ་ཅིས་ཀྱང་སྤྲོས་པར་མི་ནུས་སོ། །
en: Just as space cannot be expanded in any way, the qualities of the buddhas cannot be expanded in any way.

source: རིགས་ཀྱི་བུ་ཁང་པ་བརྩེགས་པར་བཅོམ་ལྡན་འདས་བདག་བཞུགས་པ་ནི་གང་། སངས་རྒྱས་ཀྱི་སྐུ་བཞུགས་པ་ནི་གང་། ཞེས་བྱ་བ་ཁྱོད་ཅིའི་ཕྱིར་དེ་སྐད་སྨྲ།
en: Noble son, why do you inquire about those storied mansions where the Blessed One is sitting and where the body of the Buddha manifests?”

source: དེ་ལྟར་སྤྲོས་པར་བྱེད་ཅེས་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པས་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་འདི་བསྟན་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་ལྔ་བཅུ་རྩ་བདུན་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་བཞི་བཅུ་རྩ་གཉིས་དེ་བཞིན་གཤེགས་པའི་གསང་བའི་རྗེས་སུ་འཇུག་པ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་སོ་སོར་ཐོབ་ཅིང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱང་རྒྱས་པར་གྱུར་ཏོ། །
en: As the bodhisattva Uncovering the Enemies gave this elaborate explanation of the gateway to the Dharma of nonduality, 5,700,000,000 bodhisattvas achieved the acceptance of the unborn nature of phenomena and 4,200,000,000 of them reached the gateway to the Dharma of nonduality that sets forth the secrets of the thus-gone ones.

source: ས་དང་ནམ་མཁའ་ལ་གནས་པའི་སེམས་ཅན་གྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། སྐྱེས་བུ་དམ་པ་དེ་བཞིན་གཤེགས་པའི་གསང་བའི་རྗེས་སུ་འཇུག་པ་གཉིས་སུ་མེད་པའི་ཆོས་ཀྱི་སྒོ་འདི་སྟོན་པ་བསྟན་པ་ལེགས་པར་བཤད་པ་ལེགས་སོ་ལེགས་སོ། །
en: This entire buddha realm flourished, and the beings living on earth and in the sky applauded and exclaimed, “This holy being’s excellent teaching revealing the gateway to the Dharma of nonduality that sets forth the secrets of the thus-gone ones is excellent, excellent!”

source: དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་ན་བཅོམ་ལྡན་འདས་འོད་ཟེར་འབྱུང་བའི་བདག་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལས་བཞེངས་ཏེ།
en: At that moment, the Blessed One rose from his absorption known as mastery over the emergence of light.

source: ཁང་པ་བརྩེགས་པ་གཅིག་ན་བཅོམ་ལྡན་འདས་བཞུགས་པར་ཡང་དག་པར་མཐོང་བ་མ་གཏོགས་པར་སངས་རྒྱས་ཀྱི་སྐུ་དེ་དག་དང་། ཁང་པ་བརྩེགས་པ་དེ་དག་ཀྱང་མི་སྣང་བར་གྱུར་ནས། འཁོར་ཐམས་ཅད་དང་ལྡན་པ་དེ་ངོ་མཚར་ཐོབ་པར་གྱུར་ཏོ། །
en: To the entire assembly’s amazement, all of the buddha bodies and storied mansions disappeared except for the one storied mansion in which they saw the Blessed One sitting.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྒྱལ་པོ་མང་པོའི་མཆོག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དྲང་སྲོང་རྣམ་པར་འགྲེལ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁང་པ་བརྩེགས་པ་འདི་དག་ནི་གང་ནས་འོངས།
en: The bodhisattva Foremost Among Many Kings then asked the bodhisattva Elucidating Seer, “Noble son, where did those storied mansions come from?

source: ཡང་གང་དུ་འགྲོ །
en: Where have they gone?”
